Model: "sequential_3"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_6 (LSTM)               (None, 14, 50)            11200     
                                                                 
 dropout_6 (Dropout)         (None, 14, 50)            0         
                                                                 
 lstm_7 (LSTM)               (None, 50)                20200     
                                                                 
 dropout_7 (Dropout)         (None, 50)                0         
                                                                 
 dense_3 (Dense)             (None, 5)                 255       
                                                                 
=================================================================
Total params: 31,655
Trainable params: 31,655
Non-trainable params: 0
_________________________________________________________________