Model: "sequential_2"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_4 (LSTM)               (None, 5)                 1080      
                                                                 
 dropout_4 (Dropout)         (None, 5)                 0         
                                                                 
 dense_2 (Dense)             (None, 5)                 30        
                                                                 
=================================================================
Total params: 1,110
Trainable params: 1,110
Non-trainable params: 0
_________________________________________________________________