Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_2 (LSTM)               (None, 14, 5)             1080      
                                                                 
 dropout_2 (Dropout)         (None, 14, 5)             0         
                                                                 
 lstm_3 (LSTM)               (None, 5)                 220       
                                                                 
 dropout_3 (Dropout)         (None, 5)                 0         
                                                                 
 dense_1 (Dense)             (None, 5)                 30        
                                                                 
=================================================================
Total params: 1,330
Trainable params: 1,330
Non-trainable params: 0
_________________________________________________________________