Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 14, 32)            4864      
                                                                 
 dropout (Dropout)           (None, 14, 32)            0         
                                                                 
 lstm_1 (LSTM)               (None, 14, 16)            3136      
                                                                 
 dropout_1 (Dropout)         (None, 14, 16)            0         
                                                                 
 dense (Dense)               (None, 14, 5)             85        
                                                                 
=================================================================
Total params: 8,085
Trainable params: 8,085
Non-trainable params: 0
_________________________________________________________________